app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Final"], ["room_number", 3], ["updated_at", "2020-02-27 02:09:17.515022"], ["id", 3]]
---
    def update
        @school_class = current_class
        @school_class.update(class_params)

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["room_number", 6], ["created_at", "2020-02-27 02:09:08.501440"], ["updated_at", "2020-02-27 02:09:08.501440"]]
---
    def create
        school_class = SchoolClass.create(class_params)